CEFSA - Centro Educacional da Fundação Salvador Arena |
FESA - Faculdade Engenheiro Salvador Arena | 
São Bernardo do Campo, 08 de março de 2025 | 
Heitor Santos Ferreira - RA: 081230042 - Engenharia de Computação - 6° Semestre - EC6 | 
Eletiva II - Ambientes Inteligentes | 
Professor Elias Kento Tomiyama

# TABELA DE 'TAGS'

### Importando bibliotecas

In [1]:
import pandas as pd

# Importando tabela

In [2]:
df_tags = pd.read_csv(r'C:\Users\Heitor\OneDrive - Fundação Salvador Arena\6 - Sexto Semestre\Ambientes Inteligentes\grouplens-datasets-analysis\data\tags.csv')

In [3]:
df_tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

### Realizando correções

In [4]:
df_tags.rename(columns={'userId': 'ID usuario', 'movieId': 'ID filme', 'tag': 'Tag', 'timestamp': 'Data e hora da atribuicao'}, inplace=True)

In [5]:
df_tags.head()

   ID usuario  ID filme              Tag  Data e hora da atribuicao
0           2     60756            funny                 1445714994
1           2     60756  Highly quotable                 1445714996
2           2     60756     will ferrell                 1445714992
3           2     89774     Boxing story                 1445715207
4           2     89774              MMA                 1445715200

In [6]:
df_tags['Tag'] = df_tags['Tag'].str.upper()

In [7]:
df_tags.head()

   ID usuario  ID filme              Tag  Data e hora da atribuicao
0           2     60756            FUNNY                 1445714994
1           2     60756  HIGHLY QUOTABLE                 1445714996
2           2     60756     WILL FERRELL                 1445714992
3           2     89774     BOXING STORY                 1445715207
4           2     89774              MMA                 1445715200

In [ ]:
df_tags['Data e hora da atribuicao'] = pd.to_datetime(df_tags['Data e hora da atribuicao'], unit='s')

In [9]:
df_tags.head()

   ID usuario  ID filme              Tag Data e hora da atribuicao
0           2     60756            FUNNY       2015-10-24 19:29:54
1           2     60756  HIGHLY QUOTABLE       2015-10-24 19:29:56
2           2     60756     WILL FERRELL       2015-10-24 19:29:52
3           2     89774     BOXING STORY       2015-10-24 19:33:27
4           2     89774              MMA       2015-10-24 19:33:20

### Exibindo informações gerais sobre a tabela e realizando sua apresentação final

In [10]:
print(f'O dataset possui {df_tags.shape[0]} exemplos/amostras/linhas e {df_tags.shape[1]} atributos/variáveis/colunas.')

O dataset possui 3683 exemplos/amostras/linhas e 4 atributos/variáveis/colunas.

In [11]:
df_tags.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3683 entries, 0 to 3682
Data columns (total 4 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ID usuario                 3683 non-null   int64
 1   ID filme                   3683 non-null   int64
 2   Tag                        3683 non-null   object
 3   Data e hora da atribuicao  3683 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 115.2+ KB

In [12]:
df_tags.describe()

        ID usuario       ID filme      Data e hora da atribuicao
count  3683.000000    3683.000000                           3683
mean    431.149335   27252.013576  2011-10-31 03:32:46.823784960
min       2.000000       1.000000            2006-01-13 19:09:12
25%     424.000000    1262.500000            2006-01-17 18:06:56
50%     474.000000    4454.000000            2010-03-29 03:16:04
75%     477.000000   39263.000000     2017-06-26 05:59:25.500000
max     610.000000  193565.000000            2018-09-16 11:50:03
std     158.472553   43490.558803                            NaN